<template>
    <el-row class="rules-box" :gutter="20" v-if="loading" v-loading="!loading">
        <el-col class="red-color">在此特别提醒您(商户）在确认商户电子协议之前，请认真阅读本《大千生活商户协议》，确保您充分了解本协议中各条款。请您审慎阅读并选择同意/不同意本协议。除非您接受本协议所有条款，否则您无权注册、登录或使用本协议所涉服务。您的登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。</el-col>
        <el-col class="rules" style="height: 600px; overflow-y: auto; margin-top: 15px; border: solid 1px">
            <h2 class="red-color">大千生活商户服务协议</h2>
            <div class="header">
                <p>协议编号：【{{electronicContract.el_contract_no}}】</p>
                <p>本《大千生活商户合作协议》（以下简称“本协议”）由以下各方于{{startTime}}签署：</p>
                <h4>甲方：深圳大千生活科技有限公司</h4>
                <p>统一社会信用代码：91440300MA5FAC9C21</p>
                <p>注册地址：深圳市南山区南头街道桃园路田厦金牛广场A座4008室</p>
                <p>电话：0755-32983328</p>
                <h4>乙方：<span  class="red-color">{{merchantInfo.name}}</span></h4>
                <p>统一社会信用代码：<span  class="red-color">{{merchantInfo.organization_code}}</span></p>
                <p>注册地址：<span  class="red-color">{{merchantInfo.province + merchantInfo.city + merchantInfo.area + merchantInfo.address}}</span></p>
                <p>联系人：<span  class="red-color">{{merchantInfo.contacter}}</span></p>
                <p>电话：<span  class="red-color">{{merchantInfo.contacter_phone}}</span></p>
                <p>甲乙双方为了发挥各自的优势，根据《中华人民共和国合同法》的规定，本着相互信任、真诚合作、平等自愿、等价有偿的原则，经充分友好协商，就甲方为乙方在“大千生活”平台上提供其产品及服务的在线信息发布服务的合作事宜达成如下协议：</p>
            </div>
            <div class="content">
                <h3>一、平台简介</h3>
                <p>1.1 “大千生活”是甲方全新打造的O2O互联网项目，以APP和微信小程序为载体，实现区域范围内消费者、商家、城市价值共享中心与“大千生活”平台的商业价值的高效挖掘。</p>
                <p>1.2 “大千生活”旨在为每一位用户带来更优质的消费体验，全面涵盖日常生活的衣食住行，用户可通过“大千生活”在线点餐、订购电影票、购买服饰等。同时，用户在“大千生活”消费或者参加活动，能够获得一定的积分奖励，有利于提升用户的满意度和信任值，从而强化用户粘性。</p>

                <h3>二、合作方式</h3>
                <p>按照本协议的约定，甲方为乙方在“大千生活”平台（以下简称“甲方平台”）上提供其产品及服务的在线信息发布服务，乙方向甲方支付相应的服务费。</p>

                <h3>三、合作期限</h3>
                <p>甲乙双方合作期限为自本协议生效之日起【1】年，即<span  class="red-color">{{startTime}}至{{endTime}}</span>。除非本协议到期前三十日内，其中一方向另一方书面提出终止合作，否则本协议期限届满后将自动延续【1】年，延续次数不限。</p>

                <h3>四、甲方的权利与义务</h3>
                <p>4.1 甲方为乙方在甲方平台上提供其产品及服务的在线信息发布服务。</p>
                <p>4.2 为提升乙方产品及服务的知名度，甲方为乙方提供相关宣传服务。甲方为乙方提供宣传服务所用的物料包的费用，乙方需在甲方指定期限内支付。</p>
                <p>4.3 甲方可向乙方另行提供促销、引流、推广等增值服务。乙方如需定制前述增值服务，需向甲方支付相应费用，具体费用标准以双方另行签订的补充协议约定为准。</p>
                <p>4.4 甲方对乙方在甲方平台上提供的产品及服务之价格真实性、促销活动、产品服务质量等全部信息拥有监督权利，但甲方不对乙方在甲方平台上提供的产品或服务的真实性、合法性和有效性作任何保证，不承担任何责任。乙方应积极、妥善处理因提供的产品或服务与第三人之间的争议/纠纷，由此产生的一切责任由乙方自行承担，与甲方无关；甲方基于维护自身品牌和声誉先行代垫相关费用的，可向乙方追偿。</p>
                <p>4.5 甲方作为平台的管理者，有权对乙方在甲方平台上进行的经营活动进行规范、监督和管理。甲方发现乙方存在违反法律法规、损害公共权益或甲方利益等情形的，甲方有权解除本协议，停止乙方继续使用甲方平台，同时支持和协助消费者、有关机关对乙方进行追索和查处。</p>
                <p>4.6 乙方提供的产品或服务出现安全事故的，或用户对乙方提供之产品/服务投诉较严重的（由甲方判断），甲方有权解除本协议，停止乙方继续使用甲方平台，由此所产生的一切责任，由乙方承担，与甲方无关；甲方基于维护自身品牌和声誉先行代垫相关费用的，可向乙方追偿。</p>
                <p>4.7 甲方保留判断乙方的行为是否符合甲方服务条款的要求和精神的权利，如果乙方违背了服务条款的要求和精神，甲方有权决定中断、停止对其提供服务。</p>
                <p>4.8 甲方不对乙方所发布信息的删除和储存失败负责。如因不可抗力或其他无法控制的原因（包括但不限于因通信公司有线或无线通信系统、设备的检修、维护或不稳定，或黑客攻击，或电力部门技术调整或故障，或银行方面的问题等非甲方主观过错情形）使甲方平台无法正常使用导致网上交易无法完成或丢失有关的信息、记录等，甲方不承担责任，但是甲方会尽可能合理地协助处理善后事宜。</p>
                <p>4.9 乙方授权甲方独家的、永久的、免费的许可使用权利（并有权对该权利进行再授权），使甲方有权（全部或部分地）使用、复制、修订、改写、发布、翻译、分发、执行和展示乙方发布于甲方平台的各类信息或制作其派生作品，和/或以现在已知或日后开发的任何形式、媒体或技术，将上述信息纳入其作品内。</p>
                <p>4.10 甲方有权根据业务调整情况将本协议项下的全部权利义务一并转移给其关联公司，乙方承诺对此不持有异议。</p>

                <h3>五、乙方的权利与义务</h3>
                <p>5.1乙方在甲方平台注册成功后，即成为甲方平台的用户，将得到一个用于登录甲方平台的用户名和密码，乙方可随时根据指引修改其密码。乙方全权负责其用户名和密码的安全性，应妥善保存其用户名和密码，以保障其安全、保密。乙方应对以其用户名进行的所有活动和事件负全部责任，乙方若发现任何非法使用其用户名的情况，或任何可能导致其用户名、密码存在安全隐患的情况，应立即告知甲方。</p>
                <p>5.2 乙方应按本协议约定向甲方提供资质文件，具体约定如下：</p>
                <p>5.2.1 乙方应向甲方提供真实有效的资质文件，包括但不限于营业执照、食品经营许可证、卫生许可证等与其在甲方平台提供之产品和服务相关的全部证照（需提供的具体资质文件以甲方要求为准）。</p>
                <p>5.2.2 本协议有效期内，上述资质文件的任何变更，乙方应自变更之日起三日内告知甲方并提供变更后的资质文件。</p>
                <p>5.2.3 因乙方资质问题（含资质变更）导致本协议无法继续履行的，甲方有权解除本协议，由此产生的一切责任由乙方承担。</p>
                <p>5.2.4 乙方同意为其未及时的告知或更新其资质文件承担全部责任，乙方保证其向甲方提供的全部资质文件真实、准确且不存在超过时效问题（即保证所有资质文件在本协议履行期间都处于有效期内），如因上述原因发生纠纷或被相关机关处罚，乙方应当承担全部责任，导致甲方损失的，应当承担赔偿责任。</p>
                <p>5.3 乙方应按本协议约定向甲方支付服务费，具体约定如下：</p>
                <p>5.3.1 乙方应以其在甲方平台提供产品和服务所产生的销售额为基数计算应向甲方支付的服务费，服务费的计算标准为：每笔交易销售额的【<span  class="red-color">{{merchantInfo.settlement_rate}}</span>】%。乙方同意，在本协议有效期内，在甲方通过平台公告、邮件方式或其他书面方式将服务费调整方案通知乙方后，乙方即按照调整后的服务费计算标准向甲方支付服务费。</p>
                <p>5.3.2 消费者通过甲方平台购买乙方产品或服务的，其所支付的款项由甲方代乙方收取，消费者按照甲方平台指引支付至甲方账户。在甲方账户收到消费者支付的前述款项后两个工作日（适用情形：乙方指定收款账户为乙方对公银行账户、乙方法定代表人银行账户或者乙方营业执照所显示的经营者银行账户的）或五个工作日（适用情形：乙方指定收款账户非乙方对公银行账户、乙方法定代表人银行账户或者乙方营业执照所显示的经营者银行账户的，该等情形下甲方有权要求乙方提供相应的授权收款文件以及其他证明文件）内，甲方应将扣除本条第5.3.1项约定的服务费及第三方支付平台收取的交易手续费（具体费用由第三方支付平台按一定费率收取）后的剩余款项支付至乙方指定的账户。</p>

                <h3>乙方指定账户信息如下：</h3>
                <p>户名：【<span  class="red-color">{{merchantInfo.bank_open_name}}</span>】</p>
                <p>开户行：【<span  class="red-color">{{merchantInfo.bank_name}}</span>】</p>
                <p>账号：【<span  class="red-color">{{merchantInfo.bank_card_no}}</span>】</p>
                <p>5.3.3 乙方指定账户如有任何变更需自变更之日起三日内书面通知甲方，否则由乙方自行承担一切不利后果；若甲方在收到乙方的书面通知前已支付款项或存在其他无法变更账户的情形，则甲方可继续向本条所确认的银行账户支付款项。</p>
                <p>5.4 乙方保证其在甲方平台发布的信息合法、真实和有效，不存在任何虚假、不实、错误及误导，并且保证自身具备提供产品和服务所需的资质批文、管理制度及合格人员，否则乙方将承担全部的经济损失及法律责任。</p>
                <p>5.5 乙方承诺在甲方平台开展销售产品和服务等经营活动时严格遵守《中华人民共和国消费者权益保护法》等相关法律法规，遵守甲方平台的相关规则，尊重和保护消费者的隐私权和其他法定权利。</p>
                <p>5.6 乙方保证不侵害消费者的利益，不得拒绝提供消费者在“大千生活”平台上所购买的产品及服务；否则，甲方有权解除本协议，并要求乙方承担相应的赔偿责任。</p>
                <p>5.7 为便于甲方进行宣传服务，乙方应提供合作期间在甲方平台进行营销活动和品牌形象展示所需的所有文字、图片和视频等资料。乙方应当保证对其提供的所有资料具有完整权利，并有权授权给甲方基于本协议目的进行使用；若因乙方提供的资料侵犯他人所有权、知识产权及其他任何合法权利，由乙方承担一切责任，造成甲方损失的，需承担相应的赔偿责任。</p>
                <p>5.8 若乙方产品和服务于甲方平台标注价格之外需另行收取费用，应当提前书面告知甲方并在页面进行特别提示，且乙方应当按照实际收取费用为标准向甲方支付服务费。</p>
                <p>5.9 甲方平台系统通知乙方下单后，乙方因产品和服务销售完毕等原因，不能提供相关产品和服务的，乙方应立即电话通知下单的消费者和甲方，并做好合理的安抚和处理工作；乙方未能及时、妥善处理，导致消费者和/或甲方损失的，应当承担赔偿责任。</p>
                <p>5.10 若存在用户退订的情形，乙方应在收到退订申请后告知甲方取消相应的项目，并应根据甲方通知做相应调整。</p>
                <p>5.11 乙方应按照本协议约定使用甲方平台，不得以转让、转租、出借、出租等任何形式用于非自身经营活动，一经发现，甲方有权立即解除本协议，并保留追究乙方相关责任的权利。</p>
                <p>5.12 乙方同意不对甲方平台上任何数据作商业性利用，包括但不限于在未经甲方事先书面同意的情况下，以复制、传播或向他方披露等方式使用在甲方平台上其他用户展示的任何资料。</p>

                <h3>六、保密</h3>
                <p>6.1 本协议项下甲方提供给乙方的信息、资料，除甲方作出相反的书面说明外，均应视为甲方的商业秘密，乙方应采取保密措施，予以严密保守。</p>
                <p>6.2 除为了履行本协议项下义务而需接触甲方商业秘密的有关员工外，乙方同意不向其他人员泄露甲方的任何保密信息，也不向任何第三方转让、交换或泄漏甲方提供的商业秘密。</p>
                <p>6.3 本协议项下的保密义务期限为永久。</p>
                <p>6.4 如违反本条规定致使甲方遭受损失，乙方应负法律责任，并赔偿甲方由此遭受的损失。</p>

                <h3>七、违约责任</h3>
                <p>7.1 甲乙双方均应全面履行本协议，任何一方未能按照本协议的约定履行自己的义务，应当承担违约责任。违约方应当赔偿守约方因此遭受的损失，包括但不限于守约方的直接经济损失、间接经济损失，以及守约方为追究违约责任所发生的律师费、差旅费、交通费、诉讼费、公证费、证据保全费等。</p>
                <p>7.2 若乙方逾期支付本协议项下的相关费用，则须自本协议约定的支付时间起算，每逾期一天应支付相应费用的百分之五作为迟延履行违约金。如逾期天数达到30天，甲方有权解除本协议且不承担任何违约责任，并有权向乙方追究因其违约导致损害的法律责任，损害索赔的范围参照7.1条约定。</p>
                <p>7.3 除本协议另有约定外，乙方违反本协议项下约定的，应向甲方支付违约金1万元，违约金不足以弥补甲方损失的，应予补足。</p>

                <h3>八、协议的终止</h3>
                <p>8.1 本协议期限届满或本协议约定的其他终止（含解除）情形发生时，本协议终止。除本协议另有约定外，本协议履行过程中，一方经书面通知对方且经双方协商一致后，可解除本协议。</p>
                <p>8.2 本协议终止后：</p>
                <p>8.2.1 甲方有权删除乙方在甲方平台上已发布的信息，且有权拒绝提供相关信息。</p>
                <p>8.2.2 无论本协议因何原因终止，在本协议终止前的行为所导致的任何赔偿和责任，乙方必须完全且独立地承担。</p>
                <p>8.2.3 本协议终止前乙方已与消费者达成的尚未履行完毕的订单，乙方应按照本协议、订单及甲方平台的相关规则等约定继续履行义务。</p>
                <p>8.2.4 乙方同意甲方保存乙方资质信息、产品和服务信息及交易记录等相关资料。</p>

                <h3>九、争议解决</h3>
                <p>9.1 本协议的订立、效力、解释和履行适用中华人民共和国大陆地区法律法规、规章及规范性文件的规定。</p>
                <p>9.2 由于签署、解释或履行本协议所发生的任何争议，甲乙双方应采用协商的方式解决。协商解决不成的，任何一方均可向甲方所在地有管辖权的人民法院提起诉讼。</p>

                <h3>十、生效及其他</h3>
                <p>10.1 本协议未尽事宜，由甲乙双方协商后签订补充协议，补充协议与本协议具有同等法律效力。</p>
                <p>10.2 本协议一式两份，双方各执一份，每份具有同等法律效力。</p>
            </div>
        </el-col>
        <el-col style="text-align: center; margin-top: 15px;" v-if="!check">
            <el-button @click="cancel">取 消</el-button>
            <el-button type="primary" @click="commit">我同意此协议并签约</el-button>
        </el-col>
    </el-row>
</template>

<script>
    import api from '../../../assets/js/api'

    export default {
        name: "contract-detail",
        props: {
            check: {
                type: Boolean,
                default: false,
            }
        },
        data() {
            return {
                merchantInfo: null,
                electronicContract: null,
                startTime: null,
                endTime: null,
                loading: false,
            }
        },
        methods: {
            getMerchantInfoAndElectronicContract() {
                api.get('/self/getMerchantAndElectronicContract').then(data => {
                    this.merchantInfo  = data.merchant;
                    this.electronicContract = data.contract;
                    if (!this.check) {
                        let date = new Date(data.nowTime.date);
                        this.startTime = '【' + date.getFullYear() + '】年【' + (date.getMonth() + 1) + '】月【' + date.getDate() + '】日';
                        this.endTime = '【' + (date.getFullYear() + 1) + '】年【' + (date.getMonth() + 1) + '】月【' + (date.getDate() - 1) + '】日';
                    } else {
                        let signTime = new Date(data.contract.sign_time);
                        this.startTime = '【' + signTime.getFullYear() + '】年【' + (signTime.getMonth() + 1) + '】月【' + signTime.getDate() + '】日';
                        let expiryTime = new Date(data.contract.expiry_time);
                        this.endTime = '【' + (expiryTime.getFullYear() + 1) + '】年【' + (expiryTime.getMonth() + 1) + '】月【' + expiryTime.getDate() + '】日';
                    }
                    this.loading = true;
                });
            },
            cancel() {
                api.post('/logout').then(() => {
                    this.$message.success('已取消签约')
                });
                store.dispatch('clearUserInfo');
                router.replace('/login')
            },
            commit() {
                api.post('/self/signElectronicContract').then(data => {
                    store.dispatch('setElectronicContract', data);
                    this.$emit('closeElectronicContract');
                })
            }
        },
        created() {
            this.getMerchantInfoAndElectronicContract();
        }
    }
</script>

<style scoped>
    .rules-box {
        margin-top: -40px;
    }

    .rules h2, .rules h3, .rules p {
        margin: 0;
    }

    .rules h2 {
        text-align: center;
        font-size: 20px;
        margin: 0 0 20px;
    }

    .rules h3 {
        font-size: 14px;
        margin: 15px 0 0;
    }

    .rules p {
        margin: 10px 0 0;
    }

    .rules .header {
        margin: 0 0 20px;
    }

    .red-color {
        color: red;
    }
</style>